loadtest/jmeter/jmeter.log
2026-03-10 18:43:17,251 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-03-10 18:43:17,276 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2026-03-10 18:43:17,277 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: Version 5.6.3
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: java.version=21.0.10
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: os.name=Mac OS X
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: os.arch=x86_64
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: os.version=15.5
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: java.awt.headless=true
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: Max memory     =1073741824
2026-03-10 18:43:17,285 INFO o.a.j.JMeter: Available Processors =8
2026-03-10 18:43:17,294 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-03-10 18:43:17,294 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-03-10 18:43:17,294 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/5.6.3/libexec
2026-03-10 18:43:17,294 INFO o.a.j.JMeter: user.dir  =/Users/hyosik981010/Desktop/study/shopping/loadtest/jmeter
2026-03-10 18:43:17,295 INFO o.a.j.JMeter: PWD       =/Users/hyosik981010/Desktop/study/shopping/loadtest/jmeter
2026-03-10 18:43:17,297 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: Kimhyosiks-MacBook-Air.local FullName: localhost
2026-03-10 18:43:17,313 INFO o.a.j.s.FileServer: Default base='/Users/hyosik981010/Desktop/study/shopping/loadtest/jmeter'
2026-03-10 18:43:17,318 INFO o.a.j.s.FileServer: Set new base='/Users/hyosik981010/Desktop/study/shopping/loadtest/jmeter'
2026-03-10 18:43:17,687 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-03-10 18:43:17,732 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-03-10 18:43:17,736 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-03-10 18:43:17,738 INFO o.a.j.s.SaveService: Loading file: /Users/hyosik981010/Desktop/study/shopping/loadtest/jmeter/product-cache.jmx
2026-03-10 18:43:17,796 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-03-10 18:43:17,796 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-03-10 18:43:17,796 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-03-10 18:43:17,796 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-03-10 18:43:17,796 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-03-10 18:43:17,796 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-03-10 18:43:17,866 INFO o.a.j.JMeter: Creating summariser <summary>
2026-03-10 18:43:17,888 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-03-10 18:43:17,889 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-03-10 18:43:17,889 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-03-10 18:43:17,894 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-03-10 18:43:17,894 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-03-10 18:43:17,963 INFO o.a.j.r.ClassFinder: Will scan jar /usr/local/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-03-10 18:43:18,154 INFO o.a.j.JMeter: Running test (1773135798153)
2026-03-10 18:43:18,186 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Product Cache Users
2026-03-10 18:43:18,190 INFO o.a.j.e.StandardJMeterEngine: Starting 3 threads for group Product Cache Users.
2026-03-10 18:43:18,190 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-03-10 18:43:18,191 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=3 ramp-up=3 delayedStart=false
2026-03-10 18:43:18,263 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-03-10 18:43:18,265 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-03-10 18:43:18,497 INFO o.a.j.t.JMeterThread: Thread started: Product Cache Users 1-1
2026-03-10 18:43:18,745 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Kimhyosiks-MacBook-Air.local
2026-03-10 18:43:18,762 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-03-10 18:43:18,765 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-03-10 18:43:18,765 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-03-10 18:43:18,766 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-03-10 18:43:18,766 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-03-10 18:43:19,177 INFO o.a.j.s.FileServer: Stored: /Users/hyosik981010/Desktop/study/shopping/loadtest/csv/product_hot.csv
2026-03-10 18:43:19,413 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-03-10 18:43:19,413 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-03-10 18:43:19,449 INFO o.a.j.t.JMeterThread: Thread started: Product Cache Users 1-2
2026-03-10 18:43:19,693 INFO o.a.j.s.FileServer: Stored: /Users/hyosik981010/Desktop/study/shopping/loadtest/csv/product_random.csv
2026-03-10 18:43:20,443 INFO o.a.j.t.JMeterThread: Thread started: Product Cache Users 1-3
2026-03-10 18:43:30,224 INFO o.a.j.r.Summariser: summary +    133 in 00:00:12 =   11.0/s Avg:    28 Min:     6 Max:   299 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-03-10 18:44:00,151 INFO o.a.j.r.Summariser: summary +    396 in 00:00:30 =   13.2/s Avg:    16 Min:     5 Max:    50 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-03-10 18:44:00,154 INFO o.a.j.r.Summariser: summary =    529 in 00:00:42 =   12.6/s Avg:    19 Min:     5 Max:   299 Err:     0 (0.00%)
2026-03-10 18:44:30,200 INFO o.a.j.r.Summariser: summary +    414 in 00:00:30 =   13.8/s Avg:    11 Min:     2 Max:    61 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-03-10 18:44:30,202 INFO o.a.j.r.Summariser: summary =    943 in 00:01:12 =   13.1/s Avg:    16 Min:     2 Max:   299 Err:     0 (0.00%)
2026-03-10 18:45:00,031 INFO o.a.j.r.Summariser: summary +    417 in 00:00:30 =   14.0/s Avg:     9 Min:     2 Max:    29 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-03-10 18:45:00,035 INFO o.a.j.r.Summariser: summary =   1360 in 00:01:42 =   13.3/s Avg:    14 Min:     2 Max:   299 Err:     0 (0.00%)
2026-03-10 18:45:30,040 INFO o.a.j.r.Summariser: summary +    420 in 00:00:30 =   14.0/s Avg:     9 Min:     2 Max:    52 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-03-10 18:45:30,044 INFO o.a.j.r.Summariser: summary =   1780 in 00:02:12 =   13.5/s Avg:    13 Min:     2 Max:   299 Err:     0 (0.00%)
2026-03-10 18:46:00,199 INFO o.a.j.r.Summariser: summary +    423 in 00:00:30 =   14.0/s Avg:     9 Min:     2 Max:    29 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-03-10 18:46:00,201 INFO o.a.j.r.Summariser: summary =   2203 in 00:02:42 =   13.6/s Avg:    12 Min:     2 Max:   299 Err:     0 (0.00%)
2026-03-10 18:46:18,036 INFO o.a.j.t.JMeterThread: Thread finished: Product Cache Users 1-1
2026-03-10 18:46:18,254 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Product Cache Users 1-2
2026-03-10 18:46:18,254 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Product Cache Users 1-3
2026-03-10 18:46:18,255 INFO o.a.j.t.JMeterThread: Thread finished: Product Cache Users 1-2
2026-03-10 18:46:18,255 INFO o.a.j.t.JMeterThread: Thread finished: Product Cache Users 1-3
2026-03-10 18:46:18,257 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-03-10 18:46:18,258 INFO o.a.j.s.FileServer: Close: /Users/hyosik981010/Desktop/study/shopping/loadtest/csv/product_random.csv
2026-03-10 18:46:18,258 INFO o.a.j.s.FileServer: Close: /Users/hyosik981010/Desktop/study/shopping/loadtest/csv/product_hot.csv
2026-03-10 18:46:18,262 INFO o.a.j.r.Summariser: summary +    256 in 00:00:18 =   14.2/s Avg:     8 Min:     2 Max:    17 Err:     0 (0.00%) Active: 0 Started: 3 Finished: 3
2026-03-10 18:46:18,262 INFO o.a.j.r.Summariser: summary =   2459 in 00:03:00 =   13.7/s Avg:    11 Min:     2 Max:   299 Err:     0 (0.00%)